

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СведенияДляРегистрации

// Сведения для подключения в «Дополнительные отчеты и обработки» (БСП).
// Обязательна в каждой обработке и отчёте: Вид, Наименование, Версия, Информация, команды.
//
// Возвращаемое значение:
//   Структура
//
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование", "Шаблон отчета");
	ПараметрыРегистрации.Вставить("Версия", "1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация", "Шаблон отчета");

	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление");
	Команды.Колонки.Добавить("Идентификатор");
	Команды.Колонки.Добавить("Использование");
	Команды.Колонки.Добавить("ПоказыватьОповещение");
	Команды.Колонки.Добавить("Модификатор");

	Команда = Команды.Добавить();
	Команда.Представление = "Шаблон отчета";
	Команда.Идентификатор = "Открыть";
	Команда.Использование = "ОткрытиеФормы";
	Команда.ПоказыватьОповещение = Ложь;

	ПараметрыРегистрации.Вставить("Команды", Команды);
	Возврат ПараметрыРегистрации;

КонецФункции

#КонецОбласти

#КонецЕсли